tutorials/eulerVortex.twitch.alternative.numerics/eulerVortex.cyclic.twitch.moving/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.001/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    emptyPatches_empt
    {
        type            empty;
        inGroups        1(empty);
        nFaces          45000;
        startFace       44700;
    }
    top_cyc
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          150;
        startFace       89700;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  bottom_cyc;
    }
    bottom_cyc
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          150;
        startFace       89850;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  top_cyc;
    }
    inlet_cyc
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          150;
        startFace       90000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet_cyc;
    }
    outlet_cyc
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          150;
        startFace       90150;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet_cyc;
    }
)

// ************************************************************************* //
