tutorials/eulerVortex.twitch.alternative.numerics/eulerVortex.cyclic.twitch.moving/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|U|e)"
    {
      solver PBiCGStab;
      preconditioner DILU;   
      tolerance 1e-06;
      relTol 0.0;
    }

    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
        tolerance 1e-06;
	      relTol 0;
    }

    "(h|R|k|epsilon|omega)"
    {
      solver smoothSolver;
      smoother symGaussSeidel;
      tolerance 1e-06;
      relTol 0.0;
    }
}


PIMPLE
{
    momentumPredictor   yes;
    correctPhi          yes;
    nOuterCorrectors    50;
    nCorrectors         2;
    transonic           yes;
    nNonOrthogonalCorrectors 0;

    rhoMin              0.0;
    rhoMax              10.0;
}

relaxationFactors
{
    equations
    {
        ".*"        .3;
    }
}






  
// ************************************************************************* //
